cl-wepay
========

A common lisp interface to the WePay API

wepaystage42


Client ID
    51959
    This is the ID of your API application. 

Client Secret
    b7611f9cd4
    Regenerate This is a secret value for your API application 

Access Token
    STAGE_df0cb9997aa85ba9a59988ccd79a57b397eece24094e95de3fe434eaa2bec4fe
    Regenerate This is the access_token that grants this app permission to do things on behalf of Marc Battyani (marc@battyani.com). 

Account ID
    91195245
    This is the ID of the payment account where you can collect money. 

OAuth2 URL
    https://stage.wepay.com/v2/oauth2/authorize?client_id=51959&redirect_uri=fractal1.fractalconcepts.com:25143/&scope=manage_accounts,collect_payments,view_user,send_money,preapprove_payments,manage_subscriptions
    This is an example URL for the 1st step of the OAuth2 flow. 


Client ID
    154745
    This is the ID of your API application. 

Client Secret
    fb3f47449c
    Show Client Secret This is a secret value for your API application 

Access Token
    PRODUCTION_73d38d0cb3617103025f37295e01758d47372f1514034c48d3533e6e238ae3e8
    Regenerate This is the access_token that grants this app permission to do things on behalf of Marc Battyani (marc@battyani.com). 

Account ID
    1003494729
    This is the ID of the payment account where you can collect money. 

OAuth2 URL
    https://www.wepay.com/v2/oauth2/authorize?client_id=154745&redirect_uri=fractal1.fractalconcept.com:25143/&scope=manage_accounts,collect_payments,view_user,send_money,preapprove_payments,manage_subscriptions 
    This is an example URL for the 1st step of the OAuth2 flow. 

#+begin_src sh
curl https://stage.wepayapi.com/v2/app \
    -d "client_id=51959" \
    -d "client_secret=b7611f9cd4" 
#+end_src

#+results:
| client_id | active | approved | 2014-01-08 |

#+begin_src sh
curl https://stage.wepayapi.com/v2/user \
  -H "Authorization: Bearer STAGE_df0cb9997aa85ba9a59988ccd79a57b397eece24094e95de3fe434eaa2bec4fe"
#+end_src

#+results:
| user_id | Marc | Battyani | Marc Battyani | marc@battyani.com | registered |

#+begin_src sh
curl https://stage.wepayapi.com/v2/account \
  -H "Authorization: Bearer STAGE_df0cb9997aa85ba9a59988ccd79a57b397eece24094e95de3fe434eaa2bec4fe" \
    -d "account_id=91195245" 
#+end_src

#+results:
| account_id | stage | action_required | description:"" | personal | create_time:1394770310 | US | USD | currency":"USD | balance:0 | incoming_pending_amount:0 | outgoing_pending_amount:0 | reserved_amount:0 | disputed_amount:0 | withdrawal_period:null | withdrawal_next_time:null | withdrawal_bank_name:null}] | currency":"USD | ok | paused | kyc | bank_account]} |

#+begin_src sh :results output
curl https://stage.wepayapi.com/v2/checkout/create \
  -H "Authorization: Bearer STAGE_df0cb9997aa85ba9a59988ccd79a57b397eece24094e95de3fe434eaa2bec4fe" \
    -d "account_id=91195245" \
    -d "amount=24.95" \
    -d "short_description=safari dinner" \
    -d "type=GOODS"
#+end_src

#+results:
: {"checkout_id":186817790,"checkout_uri":"https:\/\/stage.wepay.com\/api\/checkout\/186817790\/f80c927a"}

#+begin_src sh :results output
curl https://stage.wepayapi.com/v2/checkout \
  -H "Authorization: Bearer STAGE_df0cb9997aa85ba9a59988ccd79a57b397eece24094e95de3fe434eaa2bec4fe" \
    -d "checkout_id=186817790" 
#+end_src

#+results:
: {"checkout_id":186817790,"account_id":91195245,"type":"GOODS","checkout_uri":"https:\/\/stage.wepay.com\/api\/checkout\/186817790\/f80c927a","short_description":"safari dinner","currency":"USD","amount":24.95,"fee_payer":"payer","state":"new","soft_descriptor":"WPY*stage","redirect_uri":"","auto_capture":true,"app_fee":0,"create_time":1394772819,"mode":"regular","amount_refunded":0,"amount_charged_back":0,"tax":0,"dispute_uri":""}

